; domain
(define (domain gripper-strips)
 (:requirements :strips :typing) 
 (:types room object robot gripper)
 (:predicates (at-robby ?r - robot ?x - room)
 	      (at ?o - object ?x - room)
	      (free ?r - robot ?g - gripper)
	      (carry ?r - robot ?o - object ?g - gripper))

   (:action move
       :parameters  (?r - robot ?from ?to - room)
       :precondition (and  (at-robby ?r ?from))
       :effect (and  (at-robby ?r ?to)
		     (not (at-robby ?r ?from))))

   (:action pick
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (at ?obj ?room) (at-robby ?r ?room) (free ?r ?g))
       :effect (and (carry ?r ?obj ?g)
		    (not (at ?obj ?room)) 
		    (not (free ?r ?g))))

   (:action drop
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (carry ?r ?obj ?g) (at-robby ?r ?room))
       :effect (and (at ?obj ?room)
		    (free ?r ?g)
		    (not (carry ?r ?obj ?g)))))

; problem
(define (problem gripper-1-2-16)
(:domain gripper-strips)
(:objects robot1 - robot
rgripper1 lgripper1 - gripper
room1 room2 - room
ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 - object)
(:init
(at-robby robot1 room1)
(free robot1 rgripper1)
(free robot1 lgripper1)
(at ball1 room2)
(at ball2 room2)
(at ball3 room2)
(at ball4 room2)
(at ball5 room2)
(at ball6 room1)
(at ball7 room2)
(at ball8 room2)
(at ball9 room1)
(at ball10 room1)
(at ball11 room2)
(at ball12 room2)
(at ball13 room2)
(at ball14 room1)
(at ball15 room2)
(at ball16 room1)
)
(:goal
(and
(at ball1 room2)
(at ball2 room2)
(at ball3 room2)
(at ball4 room1)
(at ball5 room2)
(at ball6 room1)
(at ball7 room1)
(at ball8 room1)
(at ball9 room1)
(at ball10 room1)
(at ball11 room2)
(at ball12 room1)
(at ball13 room2)
(at ball14 room2)
(at ball15 room1)
(at ball16 room1)
)
)
)

; plan
1. (pick robot1 ball14 room1 lgripper1)
   deleted: (at ball14 room1) (free robot1 lgripper1)
   added: (carry robot1 ball14 lgripper1)
   goals met: 10 of 16
2. (move robot1 room1 room2)
   deleted: (at-robby robot1 room1)
   added: (at-robby robot1 room2)
   goals met: 10 of 16
3. (pick robot1 ball12 room2 rgripper1)
   deleted: (at ball12 room2) (free robot1 rgripper1)
   added: (carry robot1 ball12 rgripper1)
   goals met: 10 of 16
4. (drop robot1 ball14 room2 lgripper1)
   deleted: (carry robot1 ball14 lgripper1)
   added: (at ball14 room2) (free robot1 lgripper1)
   goals met: 11 of 16
5. (pick robot1 ball15 room2 lgripper1)
   deleted: (at ball15 room2) (free robot1 lgripper1)
   added: (carry robot1 ball15 lgripper1)
   goals met: 11 of 16
6. (move robot1 room2 room1)
   deleted: (at-robby robot1 room2)
   added: (at-robby robot1 room1)
   goals met: 11 of 16
7. (drop robot1 ball15 room1 lgripper1)
   deleted: (carry robot1 ball15 lgripper1)
   added: (at ball15 room1) (free robot1 lgripper1)
   goals met: 12 of 16
8. (drop robot1 ball12 room1 rgripper1)
   deleted: (carry robot1 ball12 rgripper1)
   added: (at ball12 room1) (free robot1 rgripper1)
   goals met: 13 of 16
9. (move robot1 room1 room2)
   deleted: (at-robby robot1 room1)
   added: (at-robby robot1 room2)
   goals met: 13 of 16
10. (pick robot1 ball4 room2 lgripper1)
   deleted: (at ball4 room2) (free robot1 lgripper1)
   added: (carry robot1 ball4 lgripper1)
   goals met: 13 of 16
11. (pick robot1 ball7 room2 rgripper1)
   deleted: (at ball7 room2) (free robot1 rgripper1)
   added: (carry robot1 ball7 rgripper1)
   goals met: 13 of 16
12. (move robot1 room2 room1)
   deleted: (at-robby robot1 room2)
   added: (at-robby robot1 room1)
   goals met: 13 of 16
13. (drop robot1 ball4 room1 lgripper1)
   deleted: (carry robot1 ball4 lgripper1)
   added: (at ball4 room1) (free robot1 lgripper1)
   goals met: 14 of 16
14. (drop robot1 ball7 room1 rgripper1)
   deleted: (carry robot1 ball7 rgripper1)
   added: (at ball7 room1) (free robot1 rgripper1)
   goals met: 15 of 16
15. (move robot1 room1 room2)
   deleted: (at-robby robot1 room1)
   added: (at-robby robot1 room2)
   goals met: 15 of 16
16. (pick robot1 ball8 room2 lgripper1)
   deleted: (at ball8 room2) (free robot1 lgripper1)
   added: (carry robot1 ball8 lgripper1)
   goals met: 15 of 16
17. (move robot1 room2 room1)
   deleted: (at-robby robot1 room2)
   added: (at-robby robot1 room1)
   goals met: 15 of 16
18. (drop robot1 ball8 room1 lgripper1)
   deleted: (carry robot1 ball8 lgripper1)
   added: (at ball8 room1) (free robot1 lgripper1)
   goals met: 16 of 16
